benchmarks/incompressible/pimpleHFDIBFoam/settling_benchmark/10_settling_base_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleHFDIBFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         AAAA;

deltaT          BBBB;

writeControl    adjustableRunTime;

writeInterval   CCCC;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

maxCo           DDDD;

maxDeltaT       0.001;

adjustTimeStep  yes;

runTimeModifiable yes;


// ************************************************************************* //
