benchmarks/incompressible/pimpleHFDIBFoam/settling_benchmark/10_settling_base_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

nCellsHor AAAA;
nCellsVer BBBB;

vertices
(
  (-5 0  -5)
  ( 5 0  -5)
  ( 5 20 -5)
  (-5 20 -5)
  (-5 0   5)
  ( 5 0   5)
  ( 5 20  5)
  (-5 20  5)
);

blocks
(
  hex (0 1 2 3 4 5 6 7) ($nCellsHor $nCellsVer $nCellsHor) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  top
  {
    type patch;
    faces
    (
      (2 3 7 6)
    );
  }

  bottom
  {
    type wall;
    faces
    (
      (1 5 4 0)
    );
  }
  left
  {
    type wall;
    faces
    (
      (7 3 0 4)
    );
  }
  right
  {
    type wall;
    faces
    (
      (1 2 6 5)
    );
  }
  front
  {
    type wall;
    faces
    (
      (4 5 6 7)
    );
  }
  back
  {
    type wall;
    faces
    (
      (0 3 2 1)
    );
  }

);

mergePatchPairs
(
);

// ************************************************************************* //
